Repository: CalmiraLinux/port-utils
Catalog: src/locales/*.po
Languages: ru

source: Error: you must run this script as root!
ru: Ошибка: вы должны запустить этот скрипт от root!

source: The executable Port module must not be imported.
ru: Исполняемый файл Порта не может быть импортирован.

source: Error: unknown operating mode
ru: Ошибка: неизвестный режим работы

source: Directory {0} exists.
ru: Директория {0} существует.

source: Directory {} does not exist, creating a new one.
ru: Директория {} не существует, создаётся новая.

source: Directory /var/cache/ports exists.
ru: Директория /var/cache/ports существует.

source: Directory /var/cache/ports does not exist, creating a new one
ru: Директории /var/cache/ports не существует, создаю новую

source: Error: the file with distribution data does not exist, or there is no access to read it. Exit.
ru: Ошибка: файла с данными дистрибутива не существует, либо нет доступа для его чтения. Выход.

source: The previous version of ports is installed. Removed...
ru: Предыдущая версия портов установлена. Удаляется...

source: No previous ports were found.
ru: Предыдущих версий портов не установлено.

source: The previous version of the archive with ports was found in the cache. Removed ...
ru: Предыдущая версия архива с портами найдена в кеше. Удаляется...

source: No previous version of the ports system was found.
ru: Предыдущей версии системы портов не обнаружено.

source: Error! Branch {0} does not exist!
ru: Ошибка! Ветки {0} не существует!

source: Downloaded successfully!
ru: Скачивание успешно!

source: The file has not been downloaded! Check internet access.
ru: Файл не был скачан! Проверьте доступ в интернет.

source: Package unpacked successfully.
ru: Успешно распакован пакет.

source: Unknown error, crash.
ru: Неизвестная ошибка, сбой в работе.

source: Package read error. Perhaps he is broken.
ru: Ошибка чтения пакета. Возможно, он битый.

source: Package unpacking error. The format is not supported.
ru: Ошибка распаковки пакета. Формат не поддерживается.

source: Package unpacking error. Package not found. It may not have been downloaded, or a third-party program changed it's name during unpacking.
ru: Ошибка распаковки пакета. Пакет не существует. Возможно, он не был скачан, либо был удалён сторонней программой во время распаковки.

source: Directory with unpacked ports found, installing...
ru: Директория с распакованными портами найдена, устанавливается.

source: Package unpacking error: directory not found.
ru: Ошибка распаковки пакета: распакованная директория не найдена.

source: Found directory with previous ports version. Removed...
ru: Найдена директория с предыдущей версией портов. Удаляется...

source: Directory {0} is exist
ru: Директория {0} существует

source: Error: the required directory {0} does not exist!
ru: Ошибка: необходимой директории {0} не существует!

source: Directory: file {0} is exist!
ru: Директория: файл {0} существует!

source: Directory {0} does not exist
ru: Директория {0} не существует

source: Error using checkFile: argument {0} for 'mode' does not exist!
ru: Ошибка использования checkFile: аргумент {0} для 'mode' не существует!

source: Checking for cache existence...
ru: Проверка наличия кеша...

source: OK
ru: Успешно

source: FAIL: Cache directory not found
ru: НЕУДАЧНО: Директории с кешем не существует

source: Checking for the existence of log files...
ru: Проверка на наличие файлов лога

source: File {0}: OK
ru: Файл {0}: Успешно

source: Error: the required file {0} does not exist!
ru: Ошибка: необходимый файл {0} не существует!

source: Error: the required file {0} has not been deleted!
ru: Ошибка: необходимый файл {0} не может быть удалён!

source: File {0} has deleted succesfully!
ru: Файл {0} удалён успешно!

source: Checking for the existence of a source tree...
ru: Проверка на наличие дерева исходного кода...

source: Error: the required /usr/src has not been deleted!
ru: Ошибка: необходимая директория /usr/src не может быть удалена!

source: No such file /var/cache/ports/news.txt
ru: Не существует файла /var/cache/ports/news.txt

source: Error: the update-ports version is not compatible with the current Calmira version!
ru: Ошибка: версия port-utils не совместима с текущей версией Calmira!

source: Checking for correct update...
ru: Проверка на корректное обновление...

source: NOT FOUND! It is possible that something went wrong during the update.
ru: НЕ СУЩЕСТВУЕТ! Возможно, во время обновления что-то пошло не так.

source: Name: {}
ru: Имя: {}

source: Version: {}
ru: Версия: {}

source: Maintainer: {}
ru: Сопровождающий: {}

source: Depends: {}
ru: Зависимости^ {}
