Repository: CalmiraLinux/port-utils
Catalog: po/*.po
Languages: ru

source: [ ok ]
ru: [ ок ]

source: [ FAIL ]
ru: [ ошибка ]

source: [ WARN ]
ru: [ ПРЕД ]

source: Continue? (y/n)
ru: Продолжить? (y/n)

source: Connection error. Check you internet access.
ru: Ошибка подключения. Проверьте подключение к интернету.

source: The connection was aborted. Check you internet access.
ru: Подключение оборвано. Проверьте подключение к интернету

source: The executable Port program must not be imported!
ru: Исполняемая программа Портов не может быть импортирована!

source: port-utils - Port system software
ru: port-utils - утилиты для работы с системой Портов

source: Good luck ;)
ru: Удачи!

source: Install or update Port system
ru: Установить или удалить систему Портов

source: Show the Port system changelog
ru: Просмотреть список изменений системы Портов

source: Download, build and install port package
ru: Скачать, собрать и установить порт

source: Remove port package from system
ru: Удалить порт из системы

source: Show information about port package
ru: Показать информацию о порте

source: Install or update distro documentation
ru: Установить или обновить документацию дистрибутива

source: Update the port-utils metadata files
ru: Обновить метаданные port-utils

source: Cleaning the CalmiraLinux system from old ports (and other) files
ru: Очистить систему CalmiraLinux от старых файлов портов (и не только)

source: About program
ru: О программе

source: About port-utils
ru: О port-utils

source: Utilities for download, install, update, remove ports and check his changelog
ru: Утилиты для скачивания, установки, обновления, удаления портов и просмотра их списка изменений

source: (C) Michail Krasnov <linuxoid85@gmail.com>
ru: (C) Михаил Краснов <linuxoid85@gmail.com>

source: Error: you must run this script as root!
ru: Ошибка: вы должны запустить этот скрипт от root!

source: The previous version of the Port system is installed. Removed...
ru: Предыдущая версия системы Портов установлена. Удаляется...

source: Removing error!
ru: Ошибка удаления!

source: No previous Port system version were found
ru: Предыдущей версии системы Портов не обнаружено

source: The previous version of the package with Port system was found in the cache. Removed...
ru: Предыдущая версия пакета с системой Портов обнаружена в кеше. Удаляется...

source: No previous version of the packages with Port system was found
ru: Предыдущих версий пакетов системы Портов не обнаружено

source: The previous version of the package with CalmiraLinux documentation was found in the cache. Removed...
ru: Предыдущая версия пакета с документацией CalmiraLinux была обнаружена в кеше. Удаляется...

source: No previous version of the package with CalmiraLinux documentation was found
ru: Предыдущих версий с пакетом документацией CalmiraLinux не найдено

source: File {} not found
ru: Файл {} не существует

source: No error {} found
ru: Ошибки {} не существует

source: Error code: {}
ru: Код ошибки: {}

source: Exit from port-utils...
ru: Выход из port-utils...

source: Uknown mode for 'ports' class ('__init__' function)
ru: Неизвестный режим работы для класса 'ports' (функция '__init__')

source: Uknown branch {}
ru: Неизвестная ветка {}

source: Uknown error
ru: Неизвестная ошибка

source: Number of changes: {}
ru: Количество изменений: {}

source: Changes in the current update:
ru: Изменения в текущем обновлении:

source: Changes in previous missed updates:
ru: Обновления в предыдущих пропущенных обновлениях:

source: Error: old metadata file doesn't been downloaded!
ru: Ошибка: старые файлы метаданных не были скачаны!

source: Updates:
ru: Обновления портов:

source: Additions:
ru: Добавления портов:

source: Deletions:
ru: Удаления портов:

source: The update number of the received metadata is less than the number of the installed ones. This means that you are rolling back the Ports system to a previous version. You may be using the testing branch and installing an update from stable.
ru: Номер обновлений из полученных метаданных меньше номера из установленных. Это означает, что вы откатываете систему Портов до предыдущей версии. Возможно, вы используете тестовую ветку, а устанавливаете обновление из стабильной.

source: An error occurred while checking for metadata updates. The update number of the metadata received or installed could not be parsed.
ru: Произошла ошибка при проверке метаданных. Не удалось проанализировать номер обновления полученных или установленных метаданных.

source: File {} deletion error
ru: Ошибка удаления файла {}

source: Updating metadata...
ru: Обновление метаданных...

source: File {} copy error
ru: Ошибка копирования файла {}

source: Update ID: {}
ru: ID обновления: {}

source: Uknown mode or branch for 'download_file'!
ru: Неизвестный режим работы или ветка для 'download_file'!

source: Package read error. Perhaps he is broken
ru: Ошибка чтения пакета. Возможно он битый

source: Package unpacking error. The format is not supported
ru: Ошибка распаковки пакета. Формат сжатия не поддерживается

source: Package searching error. He's not found. It may have not been downloaded, or a third-party program changed it's name during unpacking
ru: Ошибка поиска пакета. Его не существует. Возможно он не был скачан или был удалён сторонней программой во время распаковки

source: Found directory with previous Port system/CalmiraLinux documentation. Removing...
ru: Найдена директория с предыдущей версией системы Портов/документацией CalmiraLinux. Удаление...

source: Copying files...
ru: Копирование файлов...

source: Uknown error of copy target files
ru: Неизвестная ошибка во время копирования файлов

source: Checking for cache existence...
ru: Проверка на наличие кеша...

source: Removing {}...
ru: Удаление {}...

source: Error removing directory {}
ru: Ошибка удаления директории {}

source: Make {}...
ru: Создание {}...

source: Error making {}
ru: Ошибка создания {}

source: Fail: cache directory not found
ru: Ошибка: директории с кешем не существует

source: Checking for log files existence...
ru: Проверка на наличие файлов журнала...

source: Checking file {}...
ru: Проверка файла {}...

source: Error removing file {}
ru: Ошибка удаления файла {}

source: Checking for src directory existence...
ru: Проверка на наличие директории src...

source: Error! Branch {} doesn't exist!
ru: Ошибка! Ветки {} не существует!

source: Error: the database already locked!
ru: Ошибка: база данных уже заблокирована!

source: An instance of the program is already running. Complete it before accessing the database.
ru: Другой экземпляр программы уже запущен. Завершите всё до получения доступа к базе данных.

source: Checking database lock...
ru: Проверка на блокировку БД...

source: Port: {}
ru: Порт: {}

source: Checking {}...
ru: Проверка {}...

source: WARNING: there is no file with instructions to remove this port
ru: ПРЕДУПРЕЖДЕНИЕ: не найдено инструкций для удаления этого порта

source: Adding {} in database...
ru: Добавление {} в базу данных...

source: Error adding {} in database: database not found!
ru: Ошибка добавления {} в базу данных: БД не существует!

source: These dependencies need to be satisfied (installed) before or after building the port {}:
ru: Эти зависимости необходимо удовлетворить (установить) до или после сборки порта {}:

source: These dependencies need to be satisfied (removed) before or after removing the installed port {}:
ru: Эти зависимости необходимо удовлетворить (удалить) до или после удаления установленного порта {}:

source: Depends:
ru: Зависимости:

source: Name: {}
ru: Имя: {}

source: Version: {}
ru: Версия: {}

source: Maintainer: {}
ru: Сопровождающий: {}

source: Priority: {}
ru: Приоритет: {}

source: Calmira release: {}
ru: Релиз Calmira: {}

source: Required: {}
ru: Необходимые: {}

source: Optional: {}
ru: Опциональные: {}

source: Recommend: {}
ru: Рекомендуемые: {}

source: Before: {}
ru: Перед этим: {}

source: Conflicts: {}
ru: Конфликты: {}

source: Info
ru: Информация

source: Usage: port-utils -h
ru: Использование: port-utils -h

source: Removing {} from database...
ru: Удаление {} из базы данных...

source: Error removing {} from database: database not found!
ru: Ошибка удаления {} из баны данных: БД не существует!
